[
    {
        "rating": 1.0,
        "review": "For starters, I've always been a big fan of Bose products.  We have a 5.1 surround sound system in the house, I have noise cancelling headphones I use for travel, etc. I was given these as a Christmas gift in 2016.  The product worked flawlessly for about a year.  Evidently there is a 1-year warranty on the product, and of course just after Christmas 2017 the product started having issues.  It won't hold a charge, will shut down suddenly, etc.  For a Bose product, especially given the cost, I would expect much more."
    },
    {
        "rating": 5.0,
        "review": "I agonized over this purchase for six months. I looked at reviews, I watched videos, I read tech specs, and did shot after shot of tequila crying into the night begging God to help me! Okay the first three are true. They arrived in one day in a really nice package. I have worn them on several bike rides and gym visits. I sweat like a whore in church and they stand up to the punishment. They have never fallen out. Even when I'm in full Rob Zombie metal thrash mode. I try to make them fall out and they will not. The app is nice and works perfectly. Also, I use Runkeeper and now I get heart rate data in that app. The sound is amazing just like all Bose products. I have Bose noise canceling headphones, a mini wireless speaker, and a Bose system in my car."
    },
    {
        "rating": 5.0,
        "review": "This is my 2nd pair of these headphones - and they are my favorites. I also own an old pair of around-ear bose soundlinks, the soundsport free, and the apple airpods. All have their pros and cons, as I will explain below. The only experience I have with noise-cancellers is with the sony wh-1000xm2 that my wife got as a surprise gift (she loves them). These are my favorite headphones for running or working out, and also watching movies on an airplane. The sound and fit is nearly identical to the soundsport free. They sound like bose headphones - pretty good, you can probably get better sound but there will be compromises in other areas. The soundsport free's have a few strange compromises to eliminate the wire - phone calls only play through the right side, and they have trouble pairing to my laptop (a razer running windows 10)- they would only pair in headset mode and not music mode. I would blame razer or microsoft, but I've never had this problem with any other headphone. These Soundsport have no nonsense with oddities like that, and the reception is a bit better as the antenna is in the wire, not enough to make a difference in practice. But there is, of course, a wire. I consider this a good thing when I run (and I run almost every day) as I tuck it into my headband to keep them from moving. I also have a lot of hair so it can be hard to fit the free's back in on the fly, need to clear all the hair out of your ear first, same with any in-ear. You can also dangle one phone from the wire around your neck without worrying about it. The buttons are much easier to press. The only downside is, they charge using a micro-usb and not the usb-C that my laptop, phone, and nintendo switch use. In fairness, the frees, sony's, and bose's soundlinks use micro-usb, too, so you'll be stuck needing to worry about an extra charging cord no matter what. By comparison, I wanted to also mention how these compare to the airpods and free's. Both of those eliminate the wire, but with the addition of a charging case that has an extra battery. The apple case is quite discreet, whereas the bose free case is hilariously huge. If you keep your phone in an otterbox or it is a panasonic toughpad, you probably won't mind the bose case. It makes quite a bump in your jeans pocket. The airpods have some funky pairing mechanisms that make them difficult to use if you have other apple equipment - For work, my employer has given me an iphone 7 and an older macbook pro from 2015. Switching the airpods between these devices will occasionally require the device be signed out and back into icloud - which is a huge headache. After the 2nd time of hitting the massive icloud reset button in the sky, they have been relegated to phone use only with my xperia. This is where the airpods excel - phone calls play through both ears, you can use both, or either one, or even share one with a colleague for a conference call. The mike is great at noise cancelling, and I work in very noisy environments. Both pods have a mike and the work some voodoo when you wear both of them to cancel out almost all noise. They do a lot of really nice stuff. My personal phone is a sony xperia xz1, and the airpods pair to and work with the sony without any hiccup, never failing to pair. They also pair to my windows laptop fine, but will only connect to one device at a time (They forget the other device and must be re-paired, which is quite painless but still an annoyance compared to the Bose). They also sound really really bad, and don't have any controls other than a play/pause by either 'double flicking' either pod while it's in your ear, or removing one pod to pause. You can find better-sounding BT headphones than the airpods for under $20, and they will have much better controls, but they won't have apple branding. The airpods charging case requires an apple-specific lightning cable, but one comes in the box so it's not a huge deal. The soundsport free's, by contrast, feature the excellent sound quality of the soundsports, IMO they sound even better because they are newer. They are my favorite headphones for just listening to music around the house or taking a quick phone call. Unlike the airpods, they don't really work with just one. The right bud is the \"master\": it is used for phone calls (there is no mike in the left bud), it also has the +,...,- buttons on the top, which are slightly awkward because they are hard to press. The left bud does not play voice calls, it is used for music only. It also has the BT pairing button on it. You can almost get away with using only the right bud, so long as you don't want/need to switch devices. You can also use just the left bud, but the right bud needs to be kept within range (e.g., in a pocket) and also out of the charging case. However, the soundsport free's have one big advantage, or disadvantage depending on your use case, and there is no wire connecting them. Because I have long and bushy/curly hair, my hair will push the wire around if I'm not wearing a headband or hat (e.g. whenever I'm not running) and it will cause the headphones to come loose. That is a thing of the past with the free's, and the free's are the only headphones I have ever used where I can stick them in and forget them - the airpods are slightly better than the wired headphones included with the iphone (best just left in the box, IMO) but will still fall out and bounce all over the floor if you turn your head even slightly to one side. I have noticed that if sweat gets into the free's they get a bad honky sound to them, and then need to be rinsed out. If sweat gets into the regular soundsports, they just get quieter (muffled) and the volume can then be turned up to compensate. Both versions of soundsport are quite discreet as they stick mostly within the ear area. The airpods have a white stalk that dangles below the earlobe... this contains the battery and antenna so it is necessary for now but it is quite noticable, as they are bright white. Depending on the earrings I'm wearing the stalk can clack against the earring. Right now I'm wearing 4awg glass spirals and I wear them all the time, they definitely clack into the airpods. However, the airpods are still small enough that people will want to talk to you and not realize you have headphones in to ignore them on purpose. For this purpose (e.g. airports, lounges, etc) the Soundlink around-ear's still reign supreme (mine are bright white from 2015, even with my hair they cannot be missed). If you are concerned about price, these soundsports are the least expensive of the 3 (although in such a case it is hard to argue against a pair of jvc or koss gummy headphones for 9 dollars, and live with the wire going to your phone... if the wire rips, it's only $9... I also bought my first soundsport in 2016 and they were 150 even back then - the airpods being 160 and free's being a bit more around 200. Ideally Bose would have introduced the free's at 150 and dropped the regular soundsport to 120 or so, but I don't think any of these brands are competing on price. The IT man gave me the airpods, I would not have spent my own money on them. My first pair died after about 2 years of daily use - early morning runs and then showers. While bose advertises them as waterproof, they are not necessarily sweatproof, dirtproof, chlorine proof, shampoo proof, etc. My 2nd pair I have been careful to rinse them out in the shower after every run, I've had them for about 8 months now and they are still going strong. I sometimes wear the airpods in the shower too and they are holding up fine, but they fall out easily (same reason why I don't run with them) and their sound is really only meant for phone calls and spoken word, not music. I try to avoid getting the soundsport free's wet. I'm sure they are just as waterproof as the regular soundsports, but there's no easy way to dry them off without worry about losing them (don't want to put in case wet, can't be hung from the towel rack because no wire, looks suspiciously like a doggo treat, etc). Long story short, if I only had one pair of headphones, it would be these. If I didn't run and exercise so much, it would be the free's. If I never listened to music and only used them for phone calls and podcasts, it would be the airpods. But, I like to run and I like to listen to music, so... the end!"
    },
    {
        "rating": 1.0,
        "review": "THIS IS THE AMENDED REVIEW Less than a month after I began using the BOSE SoundSport Earbuds, the battery life has gone from 2 hours to no hours.  After having the headphones plugged into my computer overnight, when I pressed the power button, nothing happened.  The unit no longer holds a charge.  I guess I'll have to stick with wires when listening at the gym. And now the original review. I purchased these Bose SoundSports to replace a different brand of blu-tooth earbuds that quit working a week after I purchased them.  While the Bose headphones are a comfortable fit and do sound good while I am listening to either music or an audiobook when using the rowing machine or stationary bike at the gym, I am less impressed with the battery life.  I have never had more than about 2 hours of battery life since the purchase.  I won't go into the schematic of my workouts, but each last approximately an hour.  At the end of the 2nd workout, the headphones register that the battery is near depletion.  So much for the 6 hours of battery life Bose advertises. Get these if fit and sound quality rather than battery life are what you are looking for."
    },
    {
        "rating": 5.0,
        "review": "I have tried various inexpensive wireless earbuds / headphones over the last few years, and have never found a pair that beat out my good old-fashioned wired earbuds.  Well, I recently had the opportunity to try out both Bose and Jaybird wireless buds.  Both are similar in price, have gorgeous packaging, and have similar features.  Here are the results. SOUND - Bose: 10 of 10.  Absolutely astounding sound quality.  Simply the best I have ever heard at any price, wired or wireless, period. - Jaybird: 8 of 10.  Solid sounds, fine for podcasts or casual music listening.  Bass response is nowhere close to Bose, but with some equalizer settings on your device you can come closer.  Competitive with most other nice earbuds I have tried. FIT - Bose:  7 of 10.  Surprisingly good fit considering how HUGE the buds are.  Seriously, these things are big.  They apparently house the battery and electronics that power these (since they are wireless).  But for their size, they fit fine with the included inner-ear pieces (several sizes included). - Jaybird:  9 of 10.  Excellent fit.  Tiny compared to the Bose product.  These also include many options for earbud size and inner ear inserts that hold them in place, but they remain comfortable after several hours of constant use while running. FEATURES - Bose:  9 of 10.  These have the charging port directly in one of the earbuds, which works well.  You can download the Bose app, and amazingly you can even read your pulse from the buds!  This is a fun and useful feature for various types of training. - Jaybird:  7 of 10.  Has a separate little \"mini\" dock needed for charging.  You can download an app for the device to adjust the sound and perform a few other \"minor\" functions, but I wound up deleting the app and just connecting normally via Bluetooth. So do I have a favorite?  For daily exercise use I am gravitating to the Jaybird mostly because I prefer the fit and just do not care for the giant bud size on the Bose.  But for travelling or listening when I'm not active, the Bose wins out with superior sound. In summary, the Bose is a great product - recommended!"
    },
    {
        "rating": 1.0,
        "review": "First off, let me start by saying that I would love nothing more than to be able to give the Bose SoundSport headphones five stars. These are the most comfortable headphones I have even worn and the sound quality is excellent. The issue with these headphones is the build quality. I have used these headphones probably about 15 hours a week for the last 7 months and they are falling apart. For comparison, my wife has the Jaybird X3s and they feel like they could be run over and you wouldn't notice. The photos I've attached show a couple of the places where the headphones are falling apart. The outside of each ear piece is a rubber peice that attaches to a harder plastic peice that faces the ear. The rubber on both the right and left ear bud is detaching from the harder plactic peice. I feel like they could have made the whole ear bud out of the harder plactic and attached the two halves more securely. All prices of the X3s are nicely molded together and don't look like they will fall apart. Another thing that has come up is the rubber covering the control has separated from the body of the control. The buttons were always a little spongy, but now the volume down button is almost unusable with out moving the rubber cover into just the right alignment with both hands. The controls really should never been designed with a solid plastic body and a separate rubber cover. To compare to the X3s again, the controls on those headphones are a solid unit with individual buttons for volume up and down and play/pause. There are other little things as well such as the included clip breaking with a week and rubber pices that cover where the wire enters the earbuds coming lose and sliding down the wire. Given the durability issues with these headphones they cannot be recommended. I really hope Bose addresses these issues in the next version because these really are comfortable headphones with great sound, but until then I think I will continue to find myself stealing my wife's X3s as often as I can. Update: A little plastic piece broke off from the loose volume down button (see pic) and I now have no way to decrease the volume from the headphones without using my phone."
    },
    {
        "rating": 1.0,
        "review": "The headphones fit well into my ear and stay in through hard running, but since I first received them, and over the entire 6 months of use, they have been really hard to charge. I use the included charger, and about 4 days out of 7, the battery dies within 10-30 minutes of my turning them on, even when I've charged overnight. I'm not sure if I got a lemon or not, but I am going to try to return these. The longest charge I've ever gotten is about 60 minutes. I would not recommend these."
    },
    {
        "rating": 1.0,
        "review": "Junk. The rubber seal keeps coming off the volume buttons. I have had to return these inferior headphones three times. The forth set has failed again and I will not bother getting a fifth set. These may be a Bose product, but they are junk. Spend you hard earned money on another brand."
    },
    {
        "rating": 5.0,
        "review": "LOVE THESE!  Let me count the ways:  I went on CNET.com to find the BEST headphones (after being disappointed with a crappy pair that I bought here trying to save $).  These SOUND AMAZING.  And they FIT in my ears a completely new way:  they sit in my ear, snugly, without feeling like my finger is stuck deep in my ear (if that makes sense).  But I can still have a conversation at the gym; ideal.  I LOVE them being cordless -- omg, to be on a spin bike and not worried about the distance from my phone, lol.  And...  HEART-RATE MONITOR -- I thought that would be a tedious set-up and I would never use it?  Wrong -- I'm pedaling along looking at my heart-rate go up and down in real time!  And get this: even the little pouch it comes with is perfect: it's flexible so you can jam the headphones back in, and even has a carabeaner to attach it to my backpack! IF YOU\"VE READ THIS FAR, you're a weirdo like me, who actually reads a lot of reviews before choosing.  BUT THESE NOW!  :)"
    },
    {
        "rating": 1.0,
        "review": "I am a Bose fan! However, the last 2 Bose headsets Ive had were awful. Apparently Bose won't let their headphones get loud. The clarity was well but volume was lacking. The headphones stay in your ear so A+ on that whoever said they fallout alot, I would have to question them. The reason for a 1 star is due to volume and most importantly the spottiness of this device. It was spotty at times when listening to music and this headset was notorious for the bluetooth to shut off. I would be talking to people and all of a sudden the bluetooth would be off. This happened daily! I gave it several chances but it kept doing it. Very awful product Bose!"
    },
    {
        "rating": 1.0,
        "review": "After 9 months of frustrating use, finally died over this past weekend. Every couple weeks it would start buzzing and only stop when plugging into charger to reset it. On/off button had become harder to push because the rubber cover seems to have shifted to the side and I can't put it back in place. Now doesn't work at all because for some reason is not recognized by my multiple devices (so its the headphones, not my device). For $200 I expect them to work longer than 9 months. Other less important issues: they talk too much! when turning on to pick up a call, it says several words which means you can't hear the other person, rubber cover on the volume switch popped off and can't fix, pulse isn't taken unless the app is open and active which means no analytics/graphs - you have to be looking at the app to get info - no ability to set a target HB range while exercising.  DO NOT BUY THESE - ZERO STARS."
    },
    {
        "rating": 1.0,
        "review": "In the past year I have ordered this product three times. Twice for myself and once for my significant other. The first time I ordered a pair they were amazing. Sound quality was on par with all other Bose products. They lasted for quite a while until a freak gym accident crushed them. At this point I ordered two more pairs of these. The first pair worked for a grand total of two weeks before a cracking noise appeared in the left earbud. The second pair did not work out of the box. The battery would not even charge. So all in all as long as you get a good pair of those headphones they are amazing but be warned they do send out several defective products as well as I have had several friends complain of similar issues. Very disappointing to see this from a company I have regarded as the best for so long. Update: I have now had a new paid for about 35 days and they are no longer keeping a charge. I will no longer be buying these."
    },
    {
        "rating": 2.0,
        "review": "*****BACK WITH AN UPDATE***** So I contacted BOSE and they replaced my wirless soundsport citron with a brand new set. BOSE customer service emailed me a UPS shipping label that I had to print and take to the closest UPS store front where the shipping package was provided. It was shipped and in less than 2 weeks a brand new unit arrived at my home - Thats Right Brand New. In addition, BOSE restarted the warranty for the new set I recieved - So if these malfunction they are covered - NOT from the purchase time of the original - but from the replacement time of the new set. BOSE - GOOD CUSTOMER SERVICE IN SUPPORTING YOUR PRODUCT. Today i am enjoying that great quality again thanks to the BOSE customer service commitment. 6 months into using my BOSE citron soundsport wireless headphones I have to report some things. SOUND - amazing (its BOSE), BATTERY - when I charge to 100% the charge has lasted and currently still lasts as advertised, FUNCTION - WIRELESS CONNECTION AND FUNCTION - SO FAR SO GOOD, VERY COMFORTABLE (again its BOSE), CONSTRUCTION - VERY POOR NOT BOSE QUALITY - VERY DISAPPOINTED. eventually the internal components will be exposed and consequently deteriorate way before they should during normal use due to poorly designed construction. See Pics."
    },
    {
        "rating": 1.0,
        "review": "Bought these about less than a year ago. Sound quality unsurprisingly is great, however I think Bose failed when attempting to make a \"water resistant/sweat proof\" product. All the rubbery pieces are stretching out and coming apart. Volume buttons went first, then the rubber black casing sound the earpieces. The rubber plug for the charging port has also swollen to the point it will not stay in the port. One of the Bose badges on the earpiece has fallen off as well. Looking at the photos it may seem that they have been abused or not taken care of, I assure you that is not the case. I do use them a lot but not in extremely active situations or in the elements. I use them indoors and during work for maybe 2-3 hrs a day.  I will continue use these as long as they keep working (haven't had a single technical issue) but I will definitely not replace them for another pair."
    },
    {
        "rating": 2.0,
        "review": "I enjoyed using my Bose headphones. They were comfortable in my ears and the sound quality was great. However, I am now looking for another pair of headphones after using the Bose headphones for only 14 months. The issue began with the rubber casing around the ear piece starting to warp. Because of this, the power button under the rubber casing fell out, making it difficult to turn the device on and off. Another issue that i've had, although more cosmetic, is that the logos on both earpieces have fallen out. This is also a result of the warping rubber. I recommend reading other reviews from people that have had the product for over a year to get a true sense of the longevity of this product. Its unfortunate because one of the reasons that I was willing to spend a little more for the headphones was because I thought I was getting quality that would last and pay for itself over time. Guess not..."
    },
    {
        "rating": 5.0,
        "review": "I finally found a wireless option to use with (not entirely replace) my wired Bose SoundSport earbuds.  I first tried the Jaybird X3s but had to send them back because they kept falling out of my ears.  Even the Comply ear tips kept coming out, and when they were in, I didn't like the earplug-like removal from outside sounds.  I was hesitant to switch over to wireless because of battery life issues, but the Boses have proven to last plenty long on one charge so far, and the wireless convenience is well worth having to charge them every once in a while.  I read countless reviews on the Jaybird X3s and these Bose SoundSports (and have tried both) and, at least for me, Bose win easily.  Well worth the additional $40."
    },
    {
        "rating": 2.0,
        "review": "I am writing this review approximately a year after I bought the headphones.  I used them daily ...mostly at the gym but also when cycling and on runs.  Initially there was some growing pains, especially with running and the headphones popping out but the different size buds do make a difference in terms of snug fit. The reason I'm giving them such a low review is that they're just not durable.  When you pay over $100 for headphones, you expect them to last a year or so.  Even 6-7 months into it, when going for bike rides I noticed that sound would drop out here and there if I held my neck in a certain way.  But after 11 or so months they have just fallen apart.  The covering of the bluetooth/on button has slipped off entirely and now the the bluetooth button is exposed, they don't work at all. I've not abused the headphones in any way and by and large they are well taken care of.  But even with hard, regular use, I would expect the quality to be much better in terms of build, especially from an 'elite' and certainly pricey, headphone manufacturer like Bose.  I've switched to the Jabra Elite 65t, as I don't want to purchase bose sport headphones anymore (I still love my QC35's) and so far so good, but the jury will be out til I see how well they hold up over the next year."
    },
    {
        "rating": 2.0,
        "review": "I am a very loyal Bose buyer. I've found that their quality is always really great, and their customer service is always helpful in trying to make things right. But the battery life on these headphones is so bad. I don't know that I can listen to them on the way to work, turn them off, and have enough battery to make it home at the end of the day. Even after leaving it at a full charge over night, when I remove them from the charger, it says I have a charge of 90%. I just removed them from the charger after 7-10 hours. Another really annoying feature is when you are listening to anything, the automatic voice will chime in to let you know you've connected to another device -- or has disconnected. It's just a bumbling interface with very poor battery life. I should have just gotten the AirPods."
    },
    {
        "rating": 5.0,
        "review": "I wanted to wait on reviewing these until I had a significant amount of use, as I've had other headsets in the past which either didn't hold up physically, or had rapidly diminishing battery performance. I'm pleased to report that the SoundSport headphones are still going strong, after months of near-daily use. I've worn them in a variety of activities, including running, biking, and just taking long walks, and the headphones never dislodged from my ears. Battery life is good - I've averaged 6+ hours of listening to music on a full charge. I've never had a phone call last more than 2 hours, but I would expect similar performance. Although the fit felt a little odd initially (they are larger than most earbud-style models I've worn), after a few sessions I became completely comfortable with them. The rocker control under the right earbud is a bit tricky, as you can't see it when you're wearing them and the contours of the buttons are not so distinctive that you can tell by touch alone if you're on the right button. Sound quality is excellent! Low range comes through with good depth and little distortion, even at high volumes. Voice performance is also great, and other callers are able to hear your voice clearly. One issue is that the microphone can be overwhelmed by wind when outdoors...but that's been my experience with every phone headset (wired & wireless), so I wouldn't consider it a knock on these. Charging is fast and easy with the mini-USB connector, and pairing to the phone (Android in my case) is simple - and the Bluetooth range before connection is lost is surprisingly good. Although these are more expensive than most other models I looked at, I'm confident the extra money was worth it. I definitely prefer them to the Plantronics BackBeat, which are similar in style & size. Pros - Great sound! - Solid battery life - Well-constructed & durable - Remains in-place, even during intense exercise Cons - Larger earbud size than most models - Some initial \"awkwardness\" in feel - Rocker control could use more distinctive button textures"
    },
    {
        "rating": 5.0,
        "review": "I go to the gym a lot and have been looking for a great sounding pair of wireless in ear headphones. I have tried several, from the original beats to the powerbeats and most recently the beats x. These blow them all away......big time. They fit in my ear very well (with the medium ear tips that come on the headphones) and had a small and a large size as well. From the moment you power them on they are (in my opinion) much better than beats. When turned on they tell you what device they are connected to and how much battery is left. Another great feature is the call feature. When you receive a call it tells you who is calling (if you have them as a contact) this way you don't have to take your phone out of your pocket to check who is calling before answering. The call quality was amazing, way better than on my beats. Now, the sound quality, in my opinion is MUCH better...MUCH MUCH better, than the beats x. Deep bass, clear voice. and they are very comfortable as well for the duration of my home long workout. For battery life, I have only used them once so far, but at the start of my workout they were 70%, and at the end (a little over 1 hour) they were at 60%. I listened to spotify the whole time and made one roughly 10 minute phone call, only losing 10% battery life. For anyone shopping around, or debating on whether to purchase these headphones versus the beats in ear headphones, take it from someone who has tried them.......buy these BOSE soudnsport, you won't be disappointed"
    },
    {
        "rating": 5.0,
        "review": "I have been using these headphones every day for almost 5 months now and they work just as well as the day I received them. Making the switch to the iPhone 7, I didn't want to have to carry around the lightning to 3.5mm headphone dongle everywhere if I lost the Apple lightning headphones so I decided to make the jump and purchase some wireless headphones. I never liked the idea of the fully wireless ones (i.e. those that look like Bluetooth earpieces) so these were perfect for me. I work a desk job that allows me to listen to music while I work so these are in my ears all day every day. They are very comfortable; I've used some headphones that have irritated my ears after a few hours but I'll wear these at work and again when I'm working out. They stay in place even while running - I think is thanks to the design of the ear pieces. While at work I'll use one side at a time and leave the other side draped over my shoulder. There are no issues with this as long as you use the provided clip that connect directly to cord. I recently broke this clip due to my own clumsiness and every once in awhile I need to adjust how it is draped so that it does not pull too tightly but it isn't anything that isn't manageable. Battery life is exactly what I would expect for Bluetooth headphones. I get approximately 3-5 days use between charges. That is with me using these headphones for about 9 hours every day. I did not purchase the pair with the charging case so these charge via USB. I'll plug them in when I get down to about 30% battery life (which the headphones conveniently tell you in-ear when you turn them on) and I'll have a full charge in about an hour or so. They also come with a small case that is perfect to throw in your bag when you're on the go. The microphone/volume adjust also works very well. I use the microphone daily for phone calls and the person on the other end never has any complaints about the sound. I was told that the sound is clear and it amplifies so that you can be heard. I definitely recommend these headphone for anyone that doesn't want to be tethered to their device! The sound is excellent and they are very comfortable."
    },
    {
        "rating": 2.0,
        "review": "Bottom line, they sound good, for the price.  Caveat:  When they work. Mine worked flawless, for about 6 weeks.  I used them to train (running) 3-5 times a week, in 45-80 minutes at a time.  Used them at the gym for 30-60 minutes at a time.  No issues, at all.  Great battery life, decent seal, good enough audio quality. Then, I ran my first half marathon (first organized race).  Around mile 10, they lost sync, and would not reconnect.  I didn't think much of it, but I was frustrated, as now I couldn't get my pace/time updates, and I wasn't in position, nor did I want to hold my phone in my hand.  I spent the money on these for several reasons.  Tempo playlist, updates from the Runkeeper app, reliability. Now, they will randomly power on and off without prompt.  I must charge them overnight, take them straight to the gym, as they power on and off the whole way, then re-pair them with my phone when I get there.  Once paired, they seem reliable.  Still, they power on and off, without prompt.  Update firmware?  Can't.  The unit won't stay powered on long enough to complete it.  Sometimes it makes it 60%.  Sometimes its 90%.  Never completes. So tell me, would you spend $150, get 6 weeks of flawless function, fail when you needed it, and be glitch since, and have a decent taste in your mouth?  I don't. Audio quality?  Decent...  This isn't entirely due to the drivers, but more so to the seal.  I use Westone triple and quad drivers for monitoring on stage, and casual listening, when being wired is feasible.  I'm not expecting these to sound amazing, and unfortunately, I think the drivers actually sound great.  The issue is the seal, or lack thereof.  The three size options they have, don't quite fit my ear canal, but they are proprietary, so it is what it is.  If they could utilize the Comply Foam tips used for most in-ear monitoring systems, these things could have GREAT potential in audio quality.  Want tight, clear bass?  The seal is what makes that happen. All in all, I'm rather disappointed, and its frustrating.  We'll see if I can manage a replacement pair, or if I'm stuck with these, and the frustration of it all, because I truly wanted to love them.  I've been through several low-end BT earbuds, and these are definitely the best.  May resort to apple airpods, if this situation goes unresolved."
    },
    {
        "rating": 1.0,
        "review": "PROS These things are unbelievable don’t buy any other headset I have gone through so many, the quality is here the sound is here the base is here, all that you would want for beautiful sound and extremely comfortable they come with different sizes so you can choose whatever you like, it takes a minute to get used It, my fiancé and I both love these in the battery life is excellent.HOWEVER the CONS  are I have had these for about a year now and use them just about every day and now the battery will not keep a full charge, it will charge but then within 10 min of use it goes from 100% to 20% then dies , so I haven’t looked into the warrenty but I have a feeling I am screwed, so if you don’t mind spending the money this is what  happened with mine."
    },
    {
        "rating": 5.0,
        "review": "Very, very good headphones.  I had purchased (and then returned) multiple sets of headphones in the last several months.  I kept these.  I am very picky with audio.  I'm not saying I know what I'm talking about, from a technical point of view.  I'm saying that I refuse to use headphones that don't make my music sound good.  These headphones make my music sound great.  The bass is sufficiently, but not overly, bassy.  They're very clear. Oh, and they work as a phenomenal headset for phone calls.  I have a Pixel XL and folks seem to prefer to hear me talk on these Bose headphones than to hear me right on the Pixel XL built-in mic (even when not in speakerphone mode).  You can't hear yourself quite so clearly (because these earbuds plug your ears and your speaking doesn't necessarily get funneled back into your ears over the phone), so you might need to work to get used to using them as a phone headset for phone conversations.  Once you do, though, you will love it. I don't love the tap=pause, 2x tap=advance, 3x tap=reverse button.  I would have preferred them be on three separate buttons instead.  But I'll get over that.  I don't think joining those three features into a single button saved them enough space/parts for it to be worth it, especially when a double-tap sometimes gets misunderstood as a single-tap.  And vice versa.  It's pretty annoying for the music to pause instead of advance to the next track.  Or, worse, the opposite."
    },
    {
        "rating": 5.0,
        "review": "I come from an era where earbuds were supposed to be annoying. If you didn't feel them plugging your ear, they needed to be shoved in so they were that much more uncomfortable. That's why I thought these Bose SoundSports didn't fit me! Sure, I heard my podcasts better than ever (as well as any noises that walkers of dogs in the early morning should be aware of), but I kept trying to push them into my ear. Why? Because they were too  comfortable! When I finally figured out they they weren't going to fall out, I realized they were SUPPOSED to be comfortable and began to enjoy these little beauties. And enjoy them I do! I often forget that I have earbuds in my ears, which makes me wonder where the voices are coming from! No, really, these earbuds are light, comfortable, and completely secure as they rest in your ear. (Please note that I am almost 60 years old and do not engage in anything more strenuous than walking uphill at a brisk clip. I cannot attest to their stick-in-your-ear-persistence if your thing is doing backflips on a trampoline. Just saying...). As for sound quality, features, and the like, again, I'm from the era of transistor radios and VHS tapes. All I can say is that the sound is great and even I figured out how to use them with no help from anyone (including Google). Bose has, once again, lived up to it's well-deserved reputation."
    },
    {
        "rating": 1.0,
        "review": "Total garbage. Started falling apart after 6 months and then the battery life went. I called customer service as they were still under warranty and while the agent was able to help me with a replacement he was extremely unprofessional and inappropriate with me on the call (asked questions about my age, made strange sexual jokes). I contacted Bose about the agents behavior and they claimed they are looking into it but havent had an update from them. Total waste of time and money. Will never buy these again and I am not impressed with Bose as a company at this point."
    },
    {
        "rating": 1.0,
        "review": "Let me just get this out of the way now:  I despise these headphones. The sound quality is great.  The headphone delivery bass which few sports oriented headsets ever deliver on.  They are also very comfortable on your ears.  Be sure to seat the rubber mold in the folds and ridges of your ears and they won't give you any fit trouble. However they are functionally worthless.  I've had expensive headphones die after 3 months that didnn't piss me off as much as these things do every single day.  The problem is that ridiculous cable between the ear buds.  Unlike the original SoundSport's cable which is smooth and slick, the cable on the Pulse is tacky to the touch and grabs at your skin.  The end result is that the slack in the cable will drag to one side (usually the right since it has the weight of the controls).  Thus stretching the cable tight across the left side of your neck up to your left ear.  Turn and look to the right and the ear bud will pop out.  The cable is too tacky to slide along the skin!  And forget about any sort of weight lifting or mat work.  You'll rip this horrible things off your head and pummel them to expensive dust with a dumbbell out of sheer rage. You may think this isn't a problem when simply running in a straight line. The next time your run, consciously track how often your turn your head to look at your surroundings.  Run through an urban setting with roads and intersections.  Track how often you turn your head to check for traffic.  You would be amazed how many times you find this thing getting bound up in a single mile of running.  You'll spend most of your time with your hands on your ears pushing the ear buds back in and trying to center that cable on your neck.  It's hard to focus on form, breathing, and stride length when your hands are constantly at the sides of your head.  I suppose you could lube up your neck with Vaseline to make it slick! And don't get me started on that goofy shirt clip.  The clip itself wedges itself onto the cable.  It doesn't  spin freely around the cable.  So if you don't get clip centered perfectly, or if your shirt is loose enough that it moves across your shoulders while you move, the clip will always be out of position.  It's not like everyone runs in a sports bra or a skin tight shirt that doesn't wiggle or move, Bose.  The clip is just as worthless as the headphones. I bought these horrible things in November so it's too late to return them now.  I'd throw them away if they didn't cost me $200.  I've ripped them off my head and nearly tossed them in the ditch while running more times than I can count.  It simply doesn't matter how good they sound when they're functionally unusable.  The slick cable of the original SoundSport appears to be fine.  My friend loves hers.  This tacky textured cable make the SoundSport Pulse an absolute curse.  For the extra $50, you're only buying yourself a headache.  Do yourself a favor and buy literally anything but these headphones and you'll be much happier with your purchase.  Or give them to your competition instead!  They'll be so distracted messing with these things on the race course that you'll easily pass them.  Though you may not set a PR since you'll be laughing so hard at their misfortune."
    },
    {
        "rating": 1.0,
        "review": "Needless to say the sound is just perfect. this is my 4th pair of earbuds from BOSE. I purchased this item on March 24, 2017, 40 days ago, and the earpiece started to fell apart. I am treating the headphone like a jewel (because BOSE craft jewels), I am not taking it to any gym or outdoors, just in my office or inside my home. I am kind of worry now with this purchase and I don't know how to get this resolved. UPDATE AUGUST 24, 2017 Exactly 5 months later, happened what I supposed it will happen... No longer working!!! My humble by ACCURATE recommendation is \"AVOID THIS PRODUCT\" way too expensive to last 5 months only, at this point is my worst BOSE ever, you can consider this purchase as a scam. Very disappointed"
    },
    {
        "rating": 5.0,
        "review": "In spite of Bose's reputation, I was a bit skeptical of these headphones, not for any particular reason, but perhaps only because a link over Bluetooth did not inspire confidence in me concerning final sound quality. Looking at the photos of the headphones, too, made me somewhat concerned that these would be a bit uncomfortable in my ear, due to their design and my sensitive ears. Well, I was proven wrong on both counts the minute I tried out these headphones. Without a doubt, these are the best earbud-style headphones I have ever heard. From the moment I started testing them, I was extremely impressed with their clarity, dynamic range, \"presence,\" and, yes, even comfort. Most earbuds I have used over the years require a few days of use before they start to \"break in\" (and, yes, I know there is controversy about this issue, but I have experienced it myself on multiple brands of headphones at all price levels), but these sounded wonderful right from the first moment of play. If it is helpful, let me be clear and say that I am pairing these with an iPhone X and using high-resolution (24-bit, 192kHz) files, and so some individuals might attribute my reaction to those factors. And there is, of course, a sonic improvement with high-resolution files, and the iPhone X certainly has a good onboard sound system. But after those initial trials, I \"downgraded\" to lossless rips of CD's (16-bit, 44kHz), and then, finally, moved down to mp3 files (128 bps). Although I could certainly hear the sound quality reduce as I went \"down the chain,\" the earphones themselves continued to sound wonderful, bringing new life to even those relatively low-quality mp3 files. All of this led me to conclude that these headphones sound so good, and are so comfortable to wear, that they are very likely best-in-class. Sure, you can spend over $1,000 on a set of earbuds, but I wonder if there might be a great diminishing of returns, where the tiniest incremental increase in sound quality carries with it a hefty, NON-incremental price hike. The sound from these Bose headphones is rich, easily covers the range from the lowest bass to the highest highs, has an exceptional presence, adds no noticeable noise from the Bluetooth connection, and presents a natural sonic quality that truly makes the headphones \"disappear,\" leaving only the sound. I must say again, I was deeply impressed, so much so that I will now plan to use these with many of my audio players, not just my phone. Some of the information that is easily available in the product section I will briefly mention here, as well. The length of the cord, which goes around the back of the neck, is just about the right length so that when you take the phones out of your ears, the earpieces hang in front of your chest, but don't go so far down that they become a nuisance. A nicely-placed small clip attaches to the back of your collar to further secure the headphones (and is easy to attach, remove, even when reaching behind you because it is shaped for a \"rear-handed\" grip) A very intuitive and easily-accessible volume and microphone control are on the right side of the cord in a single housing (see the photos), and a single button for on/off, paring, and charging indication are almost invisible on the one ear housing, but still easily accessible without having to look. Charging is accomplished but pulling a discreet rubber panel open on the earphone body and plugging in a micro USB cable (supplied, but perhaps too short for a lot of situations: you might want to use a different cable). Battery length is rated at about eight hours, although I have not yet been able to absolutely verify this value as of yet, it appears to be accurate. The photos of the earbuds which led me to wonder if they would be uncomfortable in my ear (the skin of my ears, including my ears themselves, are sensitive, making many earphones uncomfortable for me to wear). Bose here has done a magnificent job of developing a form fit that is both comfortable AND secure. The curved plastic you see in the photos by the earbuds is actually not plastic at all, but a very flexible and gentle silicone. You simply put the earbud near your ear, press in and twist a little back and forth, and the curved silicone piece pops into the outer ear with just enough \"grip\" (for lack of better word) to very securely hold the earbud in place, yet are almost unnoticeable. In fact, since this curved silicone piece bears some of the body's weight, it turns out, unbelievably, that these are actually more comfortable than most all of my traditional earbuds which have nothing but the ear canal components (and which I have used for years because on-the-ear headphones hurt my ears in just a matter of minutes). All I can say is that, after testing these out, I thought to myself that there is a reason that Bose has built a reputation as it has. I do not have any other Bose equipment (I did have some of their speakers back in the 1980's), so I cannot speak at all to their other devices, either good or bad. They certainly have maintained an excellent reputation over these years. What I CAN say that these headphones have easily won me over, and I am truly impressed with their ability to put our truly good sound. Seeming a bit expensive when I ordered them, I now view them as a \"bargain\" of sorts, due to their sound reproduction. Truly an EASY Five Stars, and well worth your consideration, fully understanding that headphones are a very personal choice. But I recommend you try them out if you have not already, because they truly are amazing, particularly at this price point. NOTE; These headphones come with the Stay Hear+ tips, not the standard Stay Hear tips. You will currently (mid 2018) not find replacement buds on Amazon. However, you can purchase replacements directly from Bose at a very reasonable $10 for two pairs of replacement buds, with free expedited shipping. Make sure you get the \"+\" version when ordering replacement buds!"
    },
    {
        "rating": 1.0,
        "review": "Purchased these less than a year ago when they were on sale for $99 instead of a $149. I love Bose products and have always been very pleased with them. Except today the rubber that encases the buttons started coming off as my picture shows. This obviously isn’t good as now dust and dirt will start to get inside and eventually cause them not to work. I attempted to get an exchange done through amazon (yes I know it’s been about 10 months since my purchase) BUT I wasn’t asking for a refund I was asking for an exchange and figured a trillion dollar company could work with their customers, especially one who spends thousands of dollars a year with them, well I thought wrong. The first customer service representative gave me hope saying to send them pictures and that they would escalate the issue and provided me a phone number to call. That number of course was an invalid phone number. So I contacted them again and the new representative said there was nothing they could do. At that point I asked to speak with a manager and got the run around again saying there was nothing they could do. They attempted to still try and provide me with the same number the first representative did which is an invalid phone number. I told them that multiple times yet they still tried to provide me a bogus number and said sorry there’s nothing they can do. I’m hoping the manufacturer will see this review and contact me but honestly not getting my hopes up"
    },
    {
        "rating": 1.0,
        "review": "For those - like myself - who are now looking to buy a premium pair of sports in-ears, don't waste your time on these. Bose should be absolutely ashamed that they dare offer a product like this at all. For roughly $160 including NYC taxes you get a pair of totally mediocre headphones that fall apart the second you unbox them. It's actually shocking how poorly constructed these are... See the photos, all the controls are literally falling apart! And no, I don't abuse them at all by any standards. I do blame myself for waiting too long to go back to the Bose store at Columbus Circle where I bought them, because of course, by the time they got to being useless (I can't switch them on anymore, the power button has literally fallen off!!), I'm a few weeks over my 1-year warranty period. A total sham. And that includes the store, which is operated by people who really couldn't care less. I read the EU has a 2-year warranty period, are they made up to higher standards there?! Bose: a sad excuse for a premium brand imho"
    },
    {
        "rating": 2.0,
        "review": "Sound: 5 Design/Use: 2 Battery: 1 I have the wired sound sport model but upgraded because my new iPhone doesn’t accept the audio plug without an adapter. Sound: As I would expect from Bose, the sound is full and fantastic! Use: It feels bulky in the ears, much heavier than the wired version, and easily falls out unless wedged in well. I wear the buds around my neck so it has support (and so it won’t fall to the ground if it falls out of my ears) but it often gets caught, pulls, then falls out of the ears—especially with only one in the ear. The earbuds also have a general Bluetooth issue, where it doesn’t always ring in the ear with an incoming call and often requires me to click my iPhone audio button and select “Bose soundsport” when accepting calls. I don’t know whether this issue stems from poor Bluetooth protocol implementation by Bose or by Apple, but it defeats the purpose of “hands free.” Battery: A couple months in and the battery dies after three to four hours, which, in my opinion, isn’t heavy use . This disappoints me the most out of its issues."
    },
    {
        "rating": 2.0,
        "review": "The Pros: I generally like Bose products. I'm not an audiophile, I just want to hear all the instruments along with a little thump, during workouts. I've never had issue with battery life and the connectivity to devices is slick and easy. Pet peeve: When losing contact with a device, the voice feedback feels the need to repeat the warning. It's not an airport, Bose. You don't need to get our attention. You're pumping sound directly into a person's ear-hole. 1 Warning is enough. We hear you the first time, every time. And it doesn't pause whatever it is it's interrupting, it just takes over. Mercifully, there's an on/off option for this feature. Unfortunately for me, I only discovered that fact yesterday. A \"Con\" that's a \"Pro\" for me: Other's don't like the Frankenstein's monster bolt aesthetic. I love it. It means people can see I'm wearing earbuds and cannot hear what they're saying. I even like the cable connecting the buds in this model. It allows me to rest the buds around my neck when I need to have them out for a longer spell. I don't love that the same-said Frankenstein's monster design is about as aerodynamic as an oil rig. It channels wind right into my ear and sounds like a category 4 hurricane. If I were riding faster, for longer periods of time, this would be a dealbreaker. Cons: The main problem is longevity. My first started to come apart after a year, or so. As a product built for sportspersons, it just seemed poorly manufactured, and even poorly engineered. The rubber bits housing the electronics failed exactly how one would expect... from a lesser product, not something in this price range. Bose was reasonably quick in responding to my customer service claim, but replacement pair has also begun to fail, after a month of use. The replacement also took around 2 weeks, from the time I returned the bud, 'till the time the new (almost certainly factory refurbished) phones arrived. After 6 weeks usage of the new pair, they have develop some king of signal noise in the left earbud. The real kicker is that the noise continues, even after the buds have been, ostensibly turned off. At first I literally thought my ear was malfunctioning, like there was water in it, or some such. BUt I was mistaken. The sounds were coming from INSIDE THE EARBUDS (RUN!), and indeed seemed to be associated with the electronics, because the buds would have zero power when I tired to use them the next day. So I'm girding my loins for another 2-week replacement odyssey. I think most people are willing to overpay because Bose simplifies things. We trade features and fidelity for calibration and ease-of-use. We don't, however, also expect to also trade ease for quality. This product gets a two-star rating because, in my admittedly limited experience, they are of a quality unacceptably low for a product at that price. If they were half the price, I'd still be pretty annoyed if they stopped working after a year. I think I'm probably done with Bose. I bought them to avoid this kind of drama."
    },
    {
        "rating": 2.0,
        "review": "I love the sound.  I have other Bose products and I am a big Bose fan.  But these do not stay in the ear sufficiently on long runs.  They come with three different size earpieces and none work for me, although my wired Bose earbuds have never slipped once in the couple years I have had them.  Additionally- WOW the Bluetooth is weak!!!  Just google the Bluetooth problems with these headphones- it is even well documented on Bose’ support website.  The Bluetooth receiver is on the right side so if you phone/watch is on the left- good luck.  Good luck even if it was next to the right earbud!"
    },
    {
        "rating": 5.0,
        "review": "Pairing: Pairing was great. I used them with an Android Pixel XL and no problem.  Plus you can also use NFC to pair them which is a great plus. This said, I downloaded the app and it was useless as I could not initially pair my headphones to it – it kept telling me to put them in pairing mode, which I would, but it still would not pair.  I use these w/o the mobile app. Sound: Sound was EASILY the best of the bunch – I tried 5 headsets (see other reviews).  The bass is deep. Maybe this is possible because they are so huge in your ear! Fit: Fit excellent once on the ear – also the best of all I tried.  Super fast and easy to put in and out and I love the clip on the back to ensure you don’t loose them.  I lost my last set (Epic 2s) because although they were wrapped over my neck, I forgot about them and they fell off.  Use the clip! These are HUGE buds though.  Silly Huge.  But the trade off is the great sound i guess. Call Quality: I know its not their primary function but call quality (on receiver end) was terrible.  It seems there is no mic function at all I have to hold the phone up to my face, which defeats the purpose of hands free. Overall, of all the sets I tried, these were the ones I picked.  As a bonus I got a cyber Monday deal and got them for $99! My only complaint (other than call quality) is I wish they were slightly smaller, and the battery lasted longer.  It seems to drain much faster than all the others I tried. I have also tried Apple Airpods, Bose Soundsport, Epic 2 BT, and the LG HBS730, and Jaba Elite.  See other reviews, but the bose were my final choice with the Epic a close second."
    },
    {
        "rating": 2.0,
        "review": "The sole reason for buying these was to have a nice set of wireless earbuds to use in the gym. For the first six months they worked great, then one day out of the blue they became extremely inter mitten with the bluetooth connection. At first I though it was caused by interference on the crowded flight back from Spain I was on when it began, but the problem persisted. I read some forums online and I am certainly not the only one with this issue. After doing a firmware update and software updates on the iPhone, nothing improved. It is now clear to me that the bluetooth receiver is in the right earbud, I know this because the headphones ONLY work when HOLDING THE PHONE NEXT TO MY RIGHT EAR. If the device streaming music is not in DIRECT line-of-sight with the right earbud it will not work. Move the phone to left side of your head, it cuts out. Move it back to the right, it turns back on. Put it in your front breast/shirt pocket, completely cuts out. Put it in any shorts pocket (where it goes during a workout) does not work at all. Literally only works when holding the phone by the right earbud as if you're on a call, rendering these completely USELESS especially for working out. Also suffers from extreme body interference.  It doesn't even have to physically touch your leg, if the phone gets anywhere near your leg and/or body the signal is lost by the headphones. After contacting Bose and a lengthy explanation they were kind enough to send me a *brand new* replacement....which did the exact same thing out of the box. It was nice of them to replace them, too bad it was another worthless product/waste of money. Pros: -Sounds great (when they work) -Comfortable fit Cons: -Bluetooth does not function, rendering them worthless -Does not work with phone in your pocket -CANNOT use during a workout -Does not work if streaming device (phone) touches your body in any way -Expensive for cheap components -May work just long enough to not get a refund when they die"
    },
    {
        "rating": 5.0,
        "review": "These replaced my wired Bose in-ear buds. I've been a Bose fan for many years and own over the ear QC2's, MIE2's, a sound bar and other Bose devices that I enjoy.  I like the sound of the wired MIE2 but I wanted to cut the cord for more freedom while wearing my ear buds. These do exactly what I had hoped. The \"stay hear+\" tips are a definite improvement over the older version. I insert them into my ear and twist the bud gently rearward to provide a solid hold. These buds are NOT noise cancelling but the design of the tips keeps out quite a bit more noise than the older design.  Pairing to my MacBook, iPad, iPhone and smart tv was simple.  The best part is the sound.  Both voice and music are pleasantly balanced across the frequency range. I had a cheap pair of wireless I bought last year (<$30) and the sound on those is like listening through a tin can. I did like the freedom of wireless though.  What a difference the SoundSports are. Many have noted the size of the bud being large. It is a bit big but that really doesn't detract from the design or comfort.  My only concern would be the interference you might get trying to wear them inside a bike or cycle helmet. Haven't tried that yet. The on/off and pairing control mounted on the right bud is easy to find but maybe a bit \"mushy\" to the touch. The inline control for volume and phone response is easily accessible and intuitive but also a bit soft. Not a serious issue by any means but be aware. The alligator clip to secure the headphones to your shirt is an improvement over the old style but still can pull off the cord fairly easily. Despite these few minor flaws I give these Bose SoundSport headphones a full five star rating. You won't be disappointed."
    },
    {
        "rating": 2.0,
        "review": "The sound quality, like most of the Bose headphones(4) that I have owned over the years, is of a very good quality. Nice range. But I have two reasons for rating this device so low, one minor, one major. First, the minor reason. None of the in-ear headphones fits very well in my ear. I try all the available sizes and it still fits poorly. Who knows... maybe it’s MY ears. But the major reason that Bose pisses me off is that the in-ear earbuds that I’ve owned (3 of the 4 Bose headphones mentioned above) are of a poor quality of construction. I mean, the build quality is just lousy. The volume buttons stop working; wire connections shred and stop working; Bluetooth (in these SoundSports) stops working. I’m just very tired of paying a lot for Bose audio products and they just... don’t... last... long. It’s not worth it. Henceforth, I will try other manufacturers. The QC15 that I have still seem to work okay but, of course, I only use these on trips so they don’t get the same amount of usage. If they did, I’m guessing that they’d be broken by now!!!"
    },
    {
        "rating": 2.0,
        "review": "Growing up listening to a pair of 901 speakers I've always been partial to Bose. I also really appreciate a good set of earbuds, going through a handful over the years. A little over a year ago I started a quest for a new pair of listening devices, first going through various Samsung products but none were really to my liking. I also tried the Quietcontrol 30s but decided they weren't worth the high price so I settled with these. If you'd have asked me those first few months I'd say they were satisfactory, maybe a little pricey for the sound quality. Talking over Bluetooth was not good at all, the headphones that came with my phone far surpassed these for phone calls. Battery life was also lower than what I expected- 4 hours maybe. This wasn't a dealbreaker since I was able to charge them every few days. I really just wanted them for the main function of listening so I was OK with the battery and call quality. About 6 months in they started breaking down. First I noticed the rubber surrounding the buttons was expanding causing me to have to press a little harder to pause, change songs, etc. I also noticed the battery would only get up to 80% capacity even after leaving plugged in overnight. Then the rubber surrounding the buds loosened and fell off with the rubber buttons only getting harder and harder to press. Finally last week the left bud stopped working. I'm technically still in the warranty period but I'm moving on to greener pastures."
    },
    {
        "rating": 2.0,
        "review": "The Bose style in-ear tips are the most comfortable I've ever found -- Not the round tips you cram into your ears like other brands.  These are oval shaped like your ear canal and rest in place without causing ear fatigue.  For this reason, I've been buying Bose in-ear headsets for over 10 years (back then you pretty much got them at a Bose store or the airport) trying most of the new models as they came out and following that progression to these wireless headphones. Like many other reviews, I have issues with the battery.  I plug in the headset to charge, the next day the green light on the headset is on which indicates that it has a full charge.  Turning on the headset from this full charge state, I have had the headphones report the battery was 90% and 80%.  ... so it lost 10-20% of its charge in the 30 seconds from unplugging it from the charger and putting them in my ears. Not that the percentage is accurate anyways -- It has reported 40% charge and then 15 minutes later reported that it needed to be charged.  It's gone from 100% to 50% in one hour.  You really have no idea how long they are going to last."
    },
    {
        "rating": 5.0,
        "review": "I just got these in yesterday so I can’t write a great review YET. First, I can’t believe I spent $200 on a pair of headphones but I do use my headphones a LOT so I was able to justify the splurge. This is the first pair of “high end” headphones that I’ve bought so my experience is limited. I’m comparing mostly to LG HBS850. The first thing I noticed was how big the ear pieces are. They are pretty large and protrude out of your ears quite a bit. The LG ear piece is tiny in comparison(see image). I thought there would be no way the things were staying in my ears, however, they are MUCH more comfortable than the LG ear pieces. I didn’t even realize how uncomfortable the LGs were. The Bose ear piece doesn’t actually go inside your ear canal like the LG does.  With this type of earpiece, the Bose is not quite noise canceling(nor is it supposed to be). Some of the reviews say the Bose don’t get loud enough. Since they don’t actually go inside the ear canal and create a seal like the LGs and other internal earbuds do, it does seem like they don’t get quite as loud, however, they do get plenty loud. They just don’t get so loud that it hurts. If you want that, youu probably should go with the Beats. They connected to my iPhone 7 effortlessly. A mere click( we’ll more of a mushy push) of the power button and voila there it was on my phone. Then came the sound test. Oh my goodness!! They sound amazing. I can’t believe the difference in the sound quality between these and the LGs. It’s like the difference in monaural and stereophonic sound. The bass is very strong. I’m no techy person so I can’t really go into detail about how great the sound is but it is amazing. So that’s about all I can say for now. I will update more about the quality after I’ve used them for a while."
    },
    {
        "rating": 5.0,
        "review": "First off let me give you an idea on how often I use these. Everyday for at least 3 to 6 hours. So I’m constantly pressing the pause/play button. That being said, This is now my second pair of these headphones. I only have two qualms; first the rubber around the volume/next button wears out and there’s no way to fix it (I tried crazy glue). Second, the actual Bluetooth range is maybe 10 ft. I have a very small house, only 900sqft, And placing the phone in the center of the house didn’t work either. Even with those two qualms I can’t give these a bad review because I love these wireless headphone. Bose has always delivered exceptional sound quality!  If you like them as much as me buying a second or third pair doesn’t seem so bad. Bose has spoiled me so the $20 version of these won’t do!"
    },
    {
        "rating": 5.0,
        "review": "I've only had them for two days, but I'm really happy I got them.  Read all the reviews of these and others, weighed the pros and cons. I was on the fence, knowing the sound quality of my old wired version and if I wanted to upgrade. But it comes down to this for those that had the wired sound sports before, of all headphones I've had, shure, etymonics, the Bose are the most comfortable.  They are not sound isolating, but they are fantastic for runs and long wear time.  That considered, and any difference in sound, these are so comfortable and the perfect step from my prior wired versions.  Might get the sound true for when I need quiet, but these are great and and fantastic (maybe not a good as my old shure's)."
    },
    {
        "rating": 2.0,
        "review": "I am really dissapointed in this one! As always Bose as great sounding products (please dont see this and think I don't like your products!) I have bought there QC-25, and 4 corded soundsports for friends and family. I sweat alot when i run and excess sweat was getting to my phone so I wanted  bluetooth sport headphones with good sound quality. Here's the problem. Bose made quality product but they are massive. Like dont go into your ear and the body of the headphone sticks out like an 1-1.5 inches. They make me look goofy and my ears feel heavy and bounce around when I run!  If they could make them the same size as other running products I would totally purchase it, but I have no idea how this got through product testing.... Ugh gotta wait until Bose comes out with a smaller product. Until then I will be continuely frustrated with non-sweat proof sport headphones from there competition!"
    },
    {
        "rating": 5.0,
        "review": "1/15/18 UPDATE: I have been keeping a record of my use of these ear buds and am amazed. I am finding that the battery is lasting for close to 10 hours....... I currently have used 8 hours and still have 20 % off of a full charge. These are the best earbuds on the market. I not only use them to listen to my music, but when I can't sleep I listen to the TV with them thru my phone. Really fantastic.... and so easily paired with devices. GET THEM THEY WILL BE THE LAST ONES YOU EVER NEED TO BUY...... The best ear buds I have ever had. I have very small ears and I have a very hard time finding ones that stay in my ears and no not hurt them after a time of usage. I thought I would try these because I am a Bose person. They are FANTASTIC.... very very comfortable and no matter what I  do they do not come out of my ears. I wore them for 6 hours straight and never even felt them in. The sound is Bose quality. Not like my Noise cancelling new ones, but extremely close to the sound quality (-) the noise cancellation. The small fit perfect in my tiny ears Even shaking my head."
    },
    {
        "rating": 2.0,
        "review": "Puts out good sound quality, battery life is better than average for these types of headphones, comfortable design, and no apparent issues with exposure to moisture. However, these started falling apart after 4 months of regular use and by 9 months they were close to unusable. First the logo just fell off. Then the covering on each ear bud started coming loose. Then the covering to the control button came loose, which upset the configuration to the point where pause/play and the button to reduce sound stopped working. The button for sound increase also stopped working unless you dug around with your fingernail at random. Then the volume control kept malfunctioning entirely so the volume would randomly go from max to mute to split your eardrums max volume again. To top it off, the company’s stellar warranty, even with serial numbers, won’t back a return if purchased through amazon (even though it was a direct purchase)."
    },
    {
        "rating": 5.0,
        "review": "I've used Bose wire ear buds for years and love them. Very comfortable and great sound. But like everything else, if you use them a lot, they will wear out some how. I recently \"inherited\" my daughters iPhone 7 Plus and needed a wireless solution. After researching ear buds, I settled on Jabra 65t's. They were nice, sounded good and had the features I wanted. Unfortunately, I could not keep them from falling out, even after trying to use foam ear tips. I sent the Jabras back. I didn't want the Frankenstein Bose wireless buds, so settled on these, even though they are wired together. These fit similarly to the wired Bose that I have and do not fall out! Sound is great and longevity will tell with time. I will update this review if things change."
    },
    {
        "rating": 2.0,
        "review": "Bought these new on Amazon. After charging my new SoundSports, I attempted to pair to my iPhone 6 Plus. My phone, which has successfully paired to many other Bluetooth devices, does not see the SoundSports headphones unless I reboot my phone first. Really annoying. Sending them back for a refund."
    },
    {
        "rating": 1.0,
        "review": "Update: After 18 months of owning these, they no longer charge above 50%- leading me to losing battery after about 1.5hours of use. I am EXTREMELY disappointed with these- not only are they costly, but they have poor sound, terrible bass, clarity is terrible, taking calls is tricky and they just don't last. I wish I could trade them in or return them to Bose but I'm past my window. I might have gotten 50 hours of overall usage out of these. They just sit in a drawer now and I use my Apple Airpods for everything. Stay away- do not buy this product. Overall I'd say I'm pretty disappointed. The headphones are just ok- I love cycling and these headphones are fine while sitting at my desk at work, but during active outings like running or cycling the wind greatly affects the sound quality. Sometimes I feel like I can barely hear my music. I kept them for a couple months hoping my overall opinion would change, but it hasn't and I wish I could return them. I've always used Bose products (even my Audi SUV has Bose surround sound) but there aren't worth the money. Also- you can't take calls on these-I'll be selling these and purchasing the Apple AirPods."
    },
    {
        "rating": 1.0,
        "review": "updated review ~ 45 days after purchase & and use. I'm very disappointed in these earbuds and in Bose in general. I purchased a set for myself as a Christmas gift.  My wife liked them so much I bought here a set as well.  Less than two months later, both are refusing more than 50% of the time to pair and one set also breaks its  blue-tooth pairing on a regular basis.  After three calls to Bose support, attempting to do firmware updates, and failing, Bose is replacing both earbuds but only after I send these two back to them.  (What do they think?  I'm going to keep the old ones?).  In any case I have three sets of bluetooth devices from Apple and none of them ever give me an issue.  I'm going to ditch the replacement Bose and go buy a set of Apple ear buds.  At least I know they will stay connected even if they are the most dorky looking things on the planet. my original review below. I love Bose for sound quality.  I've never been disappointed.  These are the same.  For ear buds I cannot say how great the sound is.  They are also pretty comfortable in my ears and very lightweight.  I don't even notice I'm wearing them.  But they are not perfect.  I have two issues 1. they are not compatible with a ski helmet as they protrude too far. 2. the bluetooth range seems worse than other bt devices I have (including speakers from Bose). For the (newly reduced) price they are worth it.  I am still someone who likes a wire between the buds and have not reached the point where I can put two disconnected plugs in my ears (aka the apple buds) or the new Bose buds. ymmv."
    }
]